In [30]:
import pandas as pd

fl = pd.read_csv("faria_lima.csv", sep=';')
fl.head()

                    Date  Ibirapuera  Pinheiros
0  17 de janeiro de 2016         NaN        NaN
1  18 de janeiro de 2016       749.0     1046.0
2  19 de janeiro de 2016      1003.0     1121.0
3  20 de janeiro de 2016      1075.0     1262.0
4  21 de janeiro de 2016       661.0     1016.0

In [31]:
fl.dtypes

Date           object
Ibirapuera    float64
Pinheiros     float64
dtype: object

In [42]:
fl['Date']=pd.datetime(fl['Date'])
fl.head()

TypeError: cannot convert the series to <class 'int'>

In [32]:
rain = pd.read_csv("clima.csv ", sep=';')
rain.tail()

           data    tMin   tMed    tMax   precipitacao
1249  22/01/2017      17     20      23            6,4
1250  21/01/2017      18   20,5      23           19,8
1251  20/01/2017      19     22      25            7,5
1252  19/01/2017      20     23      26           24,6
1253  18/01/2017      20     22      24             13

In [36]:
rain.columns=['data', 'tmin', 'tmed', 'tmax', 'precipitacao']
rain.head()

         data  tmin  tmed  tmax precipitacao
0  24/06/2020    14    20    26            0
1  23/06/2020    15  21,5    28            0
2  22/06/2020    15  20,5    26            0
3  21/06/2020    14  20,5    27            0
4  20/06/2020    13    20    27            0

In [38]:
#convertendo o formato str para datetime
rain['data'] = pd.to_datetime(rain['data'])
rain.dtypes

data            datetime64[ns]
tmin                     int64
tmed                    object
tmax                     int64
precipitacao            object
dtype: object

In [41]:
rain_ordenado = rain.sort_values(ascending=True, by='data')
rain_ordenado.head()

           data  tmin  tmed  tmax precipitacao
1239 2017-01-02    19  23,5    28         12,3
1211 2017-01-03    21    26    31          0,1
1180 2017-01-04    17  20,5    24            0
1150 2017-01-05    15    20    25            0
1119 2017-01-06    17    19    21            0

In [50]:
from datetime import datetime

rain['data'][1].strftime('%d/%m/%Y')

'23/06/2020'